# FabricationCannotBeInDesignOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..FabricationCannotBeInDesignOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Structural steel connections or individual structural steel fabrication elements are not allowed in Design Options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationCannotBeInDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationCannotBeInDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationCannotBeInDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace